package ru.ifmo.neerc.java;

public class C {       
	final int x;
	{
		x = 10
	}


	static final int x;
	static {
		x = 10;     //статический инициализатор. выполняется при загрузке класса    работает не в потоке мэин
	}

//бла бла бла утилитарный класс
//снаружи можем вызывать только статические методы класса


/**
 * джавадок документация епта
 */

//имя метода/поля начинаестя с буквы, доллара или подчеркивания. дальше - подчеркивание, доллар, буква или цифра
//можно называть по-русски или по-гречески
//Методы и переменные: первое слово с маленькой буквы, остальные - с большой
//файнал статик пишутся большими буквами через подчеркивание
//стейтмент по одному в строке
//всегда скобочки у ифов и вайлов
//строчки не больше 80(150) символов. их надо разумн разбивать и выравнивать
//в странном тернарном ифе всегда ставить скобочки!!!



}